{
  "backend/main.mo": "Motoko actor that defines financial questionnaire types and calculates five persona scores (risk appetite, debt profile, earning potential, emergency broke likelihood, expense fulfillment likelihood) from user responses using weighted scoring logic.",
  "feature_evidence.json": "Feature evidence report mapping each of the five financial chatbot question features to their implementing source files, component dependencies, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document providing one-sentence descriptions of every frontend source file, serving as a quick reference for the purpose and content of each component, hook, and utility.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based light and dark theme CSS custom properties for colors, borders, charts, and sidebar used throughout the app.",
  "frontend/index.html": "Minimal HTML entry point titled 'Financial Persona Chatbot' that mounts the React app into a root div via the main.tsx module script.",
  "frontend/src/App.tsx": "Root React component that manages the chat-to-dashboard view transition, maps collected chat answers to backend enum types, and calls the calculatePersonaScores mutation before rendering the Dashboard.",
  "frontend/src/components/ChatInterface.tsx": "Main chat orchestrator component that sequences five financial questions as bot messages with typing indicators, collects user answers, and calls onComplete with all responses when finished.",
  "frontend/src/components/ChatMessage.tsx": "Reusable chat bubble component rendering bot (left-aligned, navy) or user (right-aligned, gold) messages with optional typing animation dots and support for child content.",
  "frontend/src/components/Dashboard.tsx": "Displays a financial persona dashboard with five scored metrics (risk appetite, debt profile, earning potential, emergency broke risk, expense fulfillment) rendered as chart cards with color-coded descriptors, plus a reset button.",
  "frontend/src/components/ProgressIndicator.tsx": "Renders a step progress indicator showing dot/pill shapes for completed, current, and upcoming steps along with a '1 of N' label.",
  "frontend/src/components/QuestionFive.tsx": "Multi-select question component for upcoming major expenses (marriage, home, car, child, medical, other) with an optional text input for 'Other' and validation before submission.",
  "frontend/src/components/QuestionFour.tsx": "Single numeric input question asking for the percentage of income contributed to family, with a visual progress bar and label describing the contribution level.",
  "frontend/src/components/QuestionOne.tsx": "Multi-select question component for investment types (FD/RD, gold/ETFs, real estate, MFs/equity, debt) with toggle selection and a continue button.",
  "frontend/src/components/QuestionThree.tsx": "Multi-select question for active loan types (home, personal, car, education, other) where each selected loan requires an EMI/amount input, with a 'No Loans' toggle option and validation.",
  "frontend/src/components/QuestionTwo.tsx": "Single numeric input question for monthly income in INR, with Indian-locale formatting preview and validation before submission.",
  "frontend/src/components/ScoreChart.tsx": "A React component that renders a donut pie chart displaying a financial score (0–100) with an icon, numeric value, label, description, and a colored descriptor badge.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Exports a useCalculatePersonaScores mutation hook that calls the backend's calculatePersonaScores method with user question responses via the actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind base/components/utilities, imports Inter and Sora fonts, defines dark navy/gold/teal CSS custom properties, and adds utility animations for chat messages and typing indicators.",
  "frontend/src/lib/scoring.ts": "Utility functions that map raw user inputs (asset classes, income, loan amounts, family contribution, expenses) to backend enum values, and provide score-to-descriptor label/color helpers.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom navy, gold, and teal color palettes using oklch values, custom font families (Inter/Sora), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest describing the app's architecture, existing features, known issues, and requirements for a financial chatbot that collects 5 questions and displays persona scores as pie charts."
}